performance/load-test.yml
config:
  target: 'http://localhost:3001'
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 120
      arrivalRate: 10
      name: "Ramp up load"
    - duration: 300
      arrivalRate: 20
      name: "Sustained load"
    - duration: 60
      arrivalRate: 5
      name: "Cool down"
  
  defaults:
    headers:
      Content-Type: 'application/json'
  
  variables:
    testUser:
      - "test1@example.com"
      - "test2@example.com"
      - "test3@example.com"
    
scenarios:
  - name: "Authentication Flow"
    weight: 30
    flow:
      - post:
          url: "/auth/login"
          json:
            email: "{{ testUser }}"
            password: "testpassword123"
          capture:
            - json: "$.token"
              as: "authToken"
      - get:
          url: "/auth/me"
          headers:
            Authorization: "Bearer {{ authToken }}"
      - post:
          url: "/auth/logout"
          headers:
            Authorization: "Bearer {{ authToken }}"

  - name: "Content Management"
    weight: 40
    flow:
      - post:
          url: "/auth/login"
          json:
            email: "{{ testUser }}"
            password: "testpassword123"
          capture:
            - json: "$.token"
              as: "authToken"
      - get:
          url: "/content"
          headers:
            Authorization: "Bearer {{ authToken }}"
      - post:
          url: "/content"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            title: "Load Test Article {{ $randomString() }}"
            content: "This is a test article created during load testing."
            status: "draft"
          capture:
            - json: "$.id"
              as: "contentId"
      - get:
          url: "/content/{{ contentId }}"
          headers:
            Authorization: "Bearer {{ authToken }}"
      - put:
          url: "/content/{{ contentId }}"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            title: "Updated Load Test Article {{ $randomString() }}"
            content: "This article has been updated during load testing."
            status: "published"

  - name: "Widget Delivery"
    weight: 30
    flow:
      - get:
          url: "/widget/embed.js"
      - get:
          url: "/widget/content/latest"
          qs:
            limit: 10
      - get:
          url: "/widget/analytics/track"
          qs:
            event: "view"
            content_id: "{{ $randomInt(1, 100) }}"

  - name: "Analytics and Reporting"
    weight: 20
    flow:
      - post:
          url: "/auth/login"
          json:
            email: "{{ testUser }}"
            password: "testpassword123"
          capture:
            - json: "$.token"
              as: "authToken"
      - get:
          url: "/analytics/dashboard"
          headers:
            Authorization: "Bearer {{ authToken }}"
      - get:
          url: "/analytics/content/performance"
          headers:
            Authorization: "Bearer {{ authToken }}"
          qs:
            period: "7d"
      - get:
          url: "/analytics/widgets/usage"
          headers:
            Authorization: "Bearer {{ authToken }}"
          qs:
            period: "24h"

  - name: "Health Checks"
    weight: 10
    flow:
      - get:
          url: "/health"
      - get:
          url: "/metrics"